server/load-test/socket-stress.yml
config:
  target: "http://localhost:5000"
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up phase
    - duration: 60
      arrivalRate: 10
      rampTo: 50
      name: Ramp up phase
    - duration: 120
      arrivalRate: 50
      name: Sustained load phase
  plugins:
    expect: {}
  socketio:
    transports: ["websocket"]

scenarios:
  - name: "Student Session Flow"
    engine: socketio
    flow:
      - emit:
          channel: "session:start"
          data:
            topic: "Load Testing Concept"
            selectedAgent: "default"
            activeMode: "EXPLAIN"
      - wait: 2
      - emit:
          channel: "session:doubt"
          data:
            question: "How does this scale?"
      - wait: 5
      - emit:
          channel: "session:finish"